#### 📖 Terraform Plan ('src/common/prod') - failure
<details>
<summary>Terraform Plan</summary>

```hcl
data.azurerm_linux_function_app.io_fims_user: Still reading... [10s elapsed]
data.azurerm_linux_function_app.function_profile: Still reading... [10s elapsed]
module.application_gateway_itn.data.azurerm_linux_web_app.cms_backoffice_app_itn: Still reading... [10s elapsed]
data.azurerm_linux_function_app.wallet_user: Still reading... [10s elapsed]
data.azurerm_linux_function_app.wallet_user_uat: Still reading... [10s elapsed]
module.application_gateway_itn.data.azurerm_linux_web_app.fims_op_app: Still reading... [10s elapsed]
data.azurerm_linux_function_app.services_app_backend_function_app: Still reading... [10s elapsed]
data.azurerm_linux_function_app.io_sign_user: Still reading... [10s elapsed]
module.application_gateway_itn.data.azurerm_linux_web_app.ipatente_licences_app_itn: Still reading... [10s elapsed]
data.azurerm_linux_function_app.io_fims_user: Still reading... [20s elapsed]
module.application_gateway_itn.data.azurerm_linux_web_app.cms_backoffice_app_itn: Still reading... [20s elapsed]
module.application_gateway_itn.data.azurerm_linux_web_app.fims_op_app: Still reading... [20s elapsed]
data.azurerm_linux_function_app.com_citizen_func: Still reading... [10s elapsed]
data.azurerm_linux_function_app.io_sign_user: Still reading... [20s elapsed]
data.azurerm_linux_function_app.function_assets_cdn: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.session_manager_03: Still reading... [10s elapsed]
data.azurerm_linux_function_app.eucovidcert: Still reading... [10s elapsed]
module.application_gateway_itn.data.azurerm_linux_web_app.ipatente_practices_app_itn: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_payments_app_itn: Still reading... [10s elapsed]
data.azurerm_linux_web_app.firmaconio_selfcare_web_app: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.cms_backoffice_app_itn: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_licences_app_itn: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.session_manager_03: Still reading... [20s elapsed]
data.azurerm_linux_function_app.eucovidcert: Still reading... [20s elapsed]
module.application_gateway_itn.data.azurerm_linux_web_app.ipatente_vehicles_app_itn: Still reading... [10s elapsed]
module.application_gateway_itn.data.azurerm_linux_web_app.ipatente_practices_app_itn: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.fims_op_app: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_payments_app_itn: Still reading... [20s elapsed]
data.azurerm_linux_web_app.firmaconio_selfcare_web_app: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.cms_backoffice_app_itn: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_licences_app_itn: Still reading... [20s elapsed]
module.application_gateway_itn.data.azurerm_linux_web_app.appservice_devportal_be: Still reading... [10s elapsed]
module.application_gateway_itn.data.azurerm_linux_web_app.ipatente_vehicles_app_itn: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_devportal_be: Still reading... [10s elapsed]
module.application_gateway_itn.data.azurerm_linux_web_app.ipatente_payments_app_itn: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_continua: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_vehicles_app_itn: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_practices_app_itn: Still reading... [10s elapsed]
data.azurerm_linux_function_app.lollipop_function: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_devportal_be: Still reading... [20s elapsed]
module.app_backend_weu["2"].data.azurerm_key_vault_secret.app_b
Error: Unsupported attribute

  on italynorth.tf line 250, in module "monitoring_itn":
 250:   kv_id        = local.core.key_vault.italynorth.kv.id
    ├────────────────
    │ local.core.key_vault is object with 2 attributes

This object does not have an attribute named "italynorth".

Error: Unsupported attribute

  on italynorth.tf line 251, in module "monitoring_itn":
 251:   kv_common_id = local.core.key_vault.italynorth.kv.id # We are going to have only one platform KV containing every secret
    ├────────────────
    │ local.core.key_vault is object with 2 attributes

This object does not have an attribute named "italynorth".
module.function_app_services.data.azurerm_linux_function_app.rf_func: Still reading... [10s elapsed]
module.application_gateway_itn.data.azurerm_linux_web_app.session_manager_03: Still reading... [10s elapsed]
module.application_gateway_itn.data.azurerm_linux_web_app.appservice_continua: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_vehicles_app_itn: Still reading... [20s elapsed]
data.azurerm_linux_function_app.lollipop_function: Still reading... [20s elapsed]
module.apim_itn.data.azurerm_linux_web_app.cgn_pe_backend_app_01: Still reading... [10s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # module.application_gateway_itn.azurerm_web_application_firewall_policy.agw will be updated in-place
  ~ resource "azurerm_web_application_firewall_policy" "agw" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/applicationGatewayWebApplicationFirewallPolicies/io-p-itn-agw-waf-01"
        name                = "io-p-itn-agw-waf-01"
        tags                = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (4 unchanged attributes hidden)

      ~ policy_settings {
          ~ request_body_enforcement                  = false -> true
          ~ request_body_inspect_limit_in_kb          = 0 -> 128
            # (7 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.application_gateway_itn.azurerm_web_application_firewall_policy.app will be updated in-place
  ~ resource "azurerm_web_application_firewall_policy" "app" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/applicationGatewayWebApplicationFirewallPolicies/io-p-itn-agw-api-app-waf-01"
        name                = "io-p-itn-agw-api-app-waf-01"
        tags                = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (4 unchanged attributes hidden)

      ~ policy_settings {
          ~ request_body_enforcement                  = false -> true
          ~ request_body_inspect_limit_in_kb          = 0 -> 128
            # (7 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.application_gateway_weu.azurerm_web_application_firewall_policy.api_app will be updated in-place
  ~ resource "azurerm_web_application_firewall_policy" "api_app" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGatewayWebApplicationFirewallPolicies/io-p-waf-appgateway-api-app-policy"
        name                = "io-p-waf-appgateway-api-app-policy"
        tags                = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (4 unchanged attributes hidden)

      ~ policy_settings {
          ~ request_body_enforcement                  = false -> true
          ~ request_body_inspect_limit_in_kb          = 0 -> 128
            # (7 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.cosmos_api_weu.azurerm_cosmosdb_sql_container.these["notifications"] will be updated in-place
  ~ resource "azurerm_cosmosdb_sql_container" "these" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-api/sqlDatabases/db/containers/notifications"
        name                = "notifications"
        # (6 unchanged attributes hidden)

      ~ autoscale_settings {
          ~ max_throughput = 14000 -> 13000
        }

        # (2 unchanged blocks hidden)
    }

  # module.github_runner_itn.azurerm_subnet.github_runner will be updated in-place
  ~ resource "azurerm_subnet" "github_runner" {
        id                                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-github-runner-snet-01"
        name                                          = "io-p-itn-github-runner-snet-01"
      ~ service_endpoints                             = [
          - "Microsoft.Storage",
            # (1 unchanged element hidden)
        ]
        # (7 unchanged attributes hidden)
    }

  # module.monitoring_itn.azurerm_application_insights.appi will be created
  + resource "azurerm_application_insights" "appi" {
      + app_id                              = (known after apply)
      + application_type                    = "other"
      + connection_string                   = (sensitive value)
      + daily_data_cap_in_gb                = 300
      + disable_ip_masking                  = true
      + force_customer_storage_for_profiler = false
      + id                                  = (known after apply)
      + instrumentation_key                 = (sensitive value)
      + internet_ingestion_enabled          = true
      + internet_query_enabled              = true
      + local_authentication_disabled       = false
      + location                            = "italynorth"
      + name                                = "io-p-itn-appi-01"
      + resource_group_name                 = "io-p-itn-common-rg-01"
      + retention_in_days                   = 90
      + sampling_percentage                 = 100
      + tags                                = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
      + workspace_id                        = (known after apply)
    }

  # module.monitoring_itn.azurerm_application_insights_standard_web_test.web_tests["CIE L2"] will be created
  + resource "azurerm_application_insights_standard_web_test" "web_tests" {
      + application_insights_id = (known after apply)
      + enabled                 = true
      + frequency               = 900
      + geo_locations           = [
          + "emea-nl-ams-azr",
        ]
      + id                      = (known after apply)
      + location                = "italynorth"
      + name                    = "CIE L2-test-io-p-itn-appi-01"
      + resource_group_name     = "io-p-itn-common-rg-01"
      + retry_enabled           = true
      + synthetic_monitor_id    = (known after apply)
      + timeout                 = 30

      + request {
          + follow_redirects_enabled         = false
          + http_verb                        = "GET"
          + parse_dependent_requests_enabled = false
          + url                              = "https://app-backend.io.italia.it/login?authLevel=SpidL2&entityID=xx_servizicie"
        }

      + validation_rules {
          + expected_status_code        = 200
          + ssl_cert_remaining_lifetime = 1
          + ssl_check_enabled           = true
        }
    }

  # module.monitoring_itn.azurerm_application_insights_standard_web_test.web_tests["CIE L3"] will be created
  + resource "azurerm_application_insights_standard_web_test" "web_tests" {
      + application_insights_id = (known after apply)
      + enabled                 = true
      + frequency               = 900
      + geo_locations           = [
          + "emea-nl-ams-azr",
        ]
      + id                      = (known after apply)
      + location                = "italynorth"
      + name                    = "CIE L3-test-io-p-itn-appi-01"
      + resource_group_name     = "io-p-itn-common-rg-01"
      + retry_enabled           = true
      + synthetic_monitor_id    = (known after apply)
      + timeout                 = 30

      + request {
          + follow_redirects_enabled         = false
          + http_verb                        = "GET"
          + parse_dependent_requests_enabled = false
          + url                              = "https://app-backend.io.italia.it/login?authLevel=SpidL3&entityID=xx_servizicie"
        }

      + validation_rules {
          + expected_status_code        = 200
          + ssl_cert_remaining_lifetime = 1
          + ssl_check_enabled           = true
        }
    }

  # module.monitoring_itn.azurerm_application_insights_standard_web_test.web_tests["Spid-registry"] will be created
  + resource "azurerm_application_insights_standard_web_test" "web_tests" {
      + application_insights_id = (known after apply)
      + enabled                 = false
      + frequency               = 900
      + geo_locations           = [
          + "emea-nl-ams-azr",
        ]
      + id                      = (known after apply)
      + location                = "italynorth"
      + name                    = "Spid-registry-test-io-p-itn-appi-01"
      + resource_group_name     = "io-p-itn-common-rg-01"
      + retry_enabled           = true
      + synthetic_monitor_id    = (known after apply)
      + timeout                 = 30

      + request {
          + follow_redirects_enabled         = false
          + http_verb                        = "GET"
          + parse_dependent_requests_enabled = false
          + url                              = "https://registry.spid.gov.it/metadata/idp/spid-entities-idps.xml"
        }

      + validation_rules {
          + expected_status_code        = 200
          + ssl_cert_remaining_lifetime = 1
          + ssl_check_enabled           = true
        }
    }

  # module.monitoring_itn.azurerm_application_insights_standard_web_test.web_tests["SpidL2-arubaid"] will be created
  + resource "azurerm_application_insights_standard_web_test" "web_tests" {
      + application_insights_id = (known after apply)
      + enabled                 = true
      + frequency               = 900
      + geo_locations           = [
          + "emea-nl-ams-azr",
        ]
      + id                      = (known after apply)
      + location                = "italynorth"
      + name                    = "SpidL2-arubaid-test-io-p-itn-appi-01"
      + resource_group_name     = "io-p-itn-common-rg-01"
      + retry_enabled           = true
      + synthetic_monitor_id    = (known after apply)
      + timeout                 = 30

      + request {
          + follow_redirects_enabled         = false
          + http_verb                        = "GET"
          + parse_dependent_requests_enabled = false
          + url                              = "https://app-backend.io.italia.it/login?authLevel=SpidL2&entityID=arubaid"
        }

      + validation_rules {
          + expected_status_code        = 200
          + ssl_cert_remaining_lifetime = 1
          + ssl_check_enabled           = true
        }
    }

  # module.monitoring_itn.azurerm_application_insights_standard_web_test.web_tests["SpidL2-infocamere"] will be created
  + resource "azurerm_application_insights_standard_web_test" "web_tests" {
      + application_insights_id = (known after apply)
      + enabled                 = false
      + frequency               = 900
      + geo_locations           = [
          + "emea-nl-ams-azr",
        ]
      + id                      = (known after apply)
      + location                = "italynorth"
      + name                    = "SpidL2-infocamere-test-io-p-itn-appi-01"
      + resource_group_name     = "io-p-itn-common-rg-01"
      + retry_enabled           = true
      + synthetic_monitor_id    = (known after apply)
      + timeout                 = 30

      + request {
          + follow_redirects_enabled         = false
          + http_verb                        = "GET"
          + parse_dependent_requests_enabled = false
          + url                              = "https://app-backend.io.italia.it/login?authLevel=SpidL2&entityID=infocamereid"
        }

      + validation_rules {
          + expected_status_code        = 200
          + ssl_cert_remaining_lifetime = 1
          + ssl_check_enabled           = true
        }
    }

  # module.monitoring_itn.azurerm_application_insights_standard_web_test.web_tests["SpidL2-infocertid"] will be created
  + resource "azurerm_application_insights_standard_web_test" "web_tests" {
      + application_insights_id = (known after apply)
      + enabled                 = true
      + frequency               = 900
      + geo_locations           = [
          + "emea-nl-ams-azr",
        ]
      + id                      = (known after apply)
      + location                = "italynorth"
      + name                    = "SpidL2-infocertid-test-io-p-itn-appi-01"
      + resource_group_name     = "io-p-itn-common-rg-01"
      + retry_enabled           = true
      + synthetic_monitor_id    = (known after apply)
      + timeout                 = 30

      + request {
          + follow_redirects_enabled         = false
          + http_verb                        = "GET"
          + parse_dependent_requests_enabled = false
          + url                              = "https://app-backend.io.italia.it/login?authLevel=SpidL2&entityID=infocertid"
        }

      + validation_rules {
          + expected_status_code        = 200
          + ssl_cert_remaining_lifetime = 1
          + ssl_check_enabled           = true
        }
    }

  # module.monitoring_itn.azurerm_application_insights_standard_web_test.web_tests["SpidL2-lepidaid"] will be created
  + resource "azurerm_application_insights_standard_web_test" "web_tests" {
      + application_insights_id = (known after apply)
      + enabled                 = true
      + frequency               = 900
      + geo_locations           = [
          + "emea-nl-ams-azr",
        ]
      + id                      = (known after apply)
      + location                = "italynorth"
      + name                    = "SpidL2-lepidaid-test-io-p-itn-appi-01"
      + resource_group_name     = "io-p-itn-common-rg-01"
      + retry_enabled           = true
      + synthetic_monitor_id    = (known after apply)
      + timeout                 = 30

      + request {
          + follow_redirects_enabled         = false
          + http_verb                        = "GET"
          + parse_dependent_requests_enabled = false
          + url                              = "https://app-backend.io.italia.it/login?authLevel=SpidL2&entityID=lepidaid"
        }

      + validation_rules {
          + expected_status_code        = 200
          + ssl_cert_remaining_lifetime = 1
          + ssl_check_enabled           = true
        }
    }

  # module.monitoring_itn.azurerm_application_insights_standard_web_test.web_tests["SpidL2-namirialid"] will be created
  + resource "azurerm_application_insights_standard_web_test" "web_tests" {
      + application_insights_id = (known after apply)
      + enabled                 = true
      + frequency               = 900
      + geo_locations           = [
          + "emea-nl-ams-azr",
        ]
      + id                      = (known after apply)
      + location                = "italynorth"
      + name                    = "SpidL2-namirialid-test-io-p-itn-appi-01"
      + resource_group_name     = "io-p-itn-common-rg-01"
      + retry_enabled           = true
      + synthetic_monitor_id    = (known after apply)
      + timeout                 = 30

      + request {
          + follow_redirects_enabled         = false
          + http_verb                        = "GET"
          + parse_dependent_requests_enabled = false
          + url                              = "https://app-backend.io.italia.it/login?authLevel=SpidL2&entityID=namirialid"
        }

      + validation_rules {
          + expected_status_code        = 200
          + ssl_cert_remaining_lifetime = 1
          + ssl_check_enabled           = true
        }
    }

  # module.monitoring_itn.azurerm_application_insights_standard_web_test.web_tests["SpidL2-posteid"] will be created
  + resource "azurerm_application_insights_standard_web_test" "web_tests" {
      + application_insights_id = (known after apply)
      + enabled                 = false
      + frequency               = 900
      + geo_locations           = [
          + "emea-nl-ams-azr",
        ]
      + id                      = (known after apply)
      + location                = "italynorth"
      + name                    = "SpidL2-posteid-test-io-p-itn-appi-01"
      + resource_group_name     = "io-p-itn-common-rg-01"
      + retry_enabled           = true
      + synthetic_monitor_id    = (known after apply)
      + timeout                 = 30

      + request {
          + follow_redirects_enabled         = false
          + http_verb                        = "GET"
          + parse_dependent_requests_enabled = false
          + url                              = "https://app-backend.io.italia.it/login?authLevel=SpidL2&entityID=posteid"
        }

      + validation_rules {
          + expected_status_code        = 200
          + ssl_cert_remaining_lifetime = 1
          + ssl_check_enabled           = true
        }
    }

  # module.monitoring_itn.azurerm_application_insights_standard_web_test.web_tests["SpidL2-sielteid"] will be created
  + resource "azurerm_application_insights_standard_web_test" "web_tests" {
      + application_insights_id = (known after apply)
      + enabled                 = false
      + frequency               = 900
      + geo_locations           = [
          + "emea-nl-ams-azr",
        ]
      + id                      = (known after apply)
      + location                = "italynorth"
      + name                    = "SpidL2-sielteid-test-io-p-itn-appi-01"
      + resource_group_name     = "io-p-itn-common-rg-01"
      + retry_enabled           = true
      + synthetic_monitor_id    = (known after apply)
      + timeout                 = 30

      + request {
          + follow_redirects_enabled         = false
          + http_verb                        = "GET"
          + parse_dependent_requests_enabled = false
          + url                              = "https://app-backend.io.italia.it/login?authLevel=SpidL2&entityID=sielteid"
        }

      + validation_rules {
          + expected_status_code        = 200
          + ssl_cert_remaining_lifetime = 1
          + ssl_check_enabled           = true
        }
    }

  # module.monitoring_itn.azurerm_application_insights_standard_web_test.web_tests["SpidL2-spiditalia"] will be created
  + resource "azurerm_application_insights_standard_web_test" "web_tests" {
      + application_insights_id = (known after apply)
      + enabled                 = true
      + frequency               = 900
      + geo_locations           = [
          + "emea-nl-ams-azr",
        ]
      + id                      = (known after apply)
      + location                = "italynorth"
      + name                    = "SpidL2-spiditalia-test-io-p-itn-appi-01"
      + resource_group_name     = "io-p-itn-common-rg-01"
      + retry_enabled           = true
      + synthetic_monitor_id    = (known after apply)
      + timeout                 = 30

      + request {
          + follow_redirects_enabled         = false
          + http_verb                        = "GET"
          + parse_dependent_requests_enabled = false
          + url                              = "https://app-backend.io.italia.it/login?authLevel=SpidL2&entityID=spiditalia"
        }

      + validation_rules {
          + expected_status_code        = 200
          + ssl_cert_remaining_lifetime = 1
          + ssl_check_enabled           = true
        }
    }

  # module.monitoring_itn.azurerm_application_insights_standard_web_test.web_tests["api-app.io.pagopa.it"] will be created
  + resource "azurerm_application_insights_standard_web_test" "web_tests" {
      + application_insights_id = (known after apply)
      + enabled                 = true
      + frequency               = 900
      + geo_locations           = [
          + "emea-nl-ams-azr",
        ]
      + id                      = (known after apply)
      + location                = "italynorth"
      + name                    = "api-app.io.pagopa.it-test-io-p-itn-appi-01"
      + resource_group_name     = "io-p-itn-common-rg-01"
      + retry_enabled           = true
      + synthetic_monitor_id    = (known after apply)
      + timeout                 = 30

      + request {
          + follow_redirects_enabled         = false
          + http_verb                        = "GET"
          + parse_dependent_requests_enabled = false
          + url                              = "https://api-app.io.pagopa.it/info"
        }

      + validation_rules {
          + expected_status_code        = 200
          + ssl_cert_remaining_lifetime = 7
          + ssl_check_enabled           = true
        }
    }

  # module.monitoring_itn.azurerm_application_insights_standard_web_test.web_tests["api-mtls.io.pagopa.it"] will be created
  + resource "azurerm_application_insights_standard_web_test" "web_tests" {
      + application_insights_id = (known after apply)
      + enabled                 = true
      + frequency               = 900
      + geo_locations           = [
          + "emea-nl-ams-azr",
        ]
      + id                      = (known after apply)
      + location                = "italynorth"
      + name                    = "api-mtls.io.pagopa.it-test-io-p-itn-appi-01"
      + resource_group_name     = "io-p-itn-common-rg-01"
      + retry_enabled           = true
      + synthetic_monitor_id    = (known after apply)
      + timeout                 = 30

      + request {
          + follow_redirects_enabled         = false
          + http_verb                        = "GET"
          + parse_dependent_requests_enabled = false
          + url                              = "https://api-mtls.io.pagopa.it"
        }

      + validation_rules {
          + expected_status_code = 400
          + ssl_check_enabled    = false
        }
    }

  # module.monitoring_itn.azurerm_application_insights_standard_web_test.web_tests["api-web.io.pagopa.it"] will be created
  + resource "azurerm_application_insights_standard_web_test" "web_tests" {
      + application_insights_id = (known after apply)
      + enabled                 = true
      + frequency               = 900
      + geo_locations           = [
          + "emea-nl-ams-azr",
        ]
      + id                      = (known after apply)
      + location                = "italynorth"
      + name                    = "api-web.io.pagopa.it-test-io-p-itn-appi-01"
      + resource_group_name     = "io-p-itn-common-rg-01"
      + retry_enabled           = true
      + synthetic_monitor_id    = (known after apply)
      + timeout                 = 30

      + request {
          + follow_redirects_enabled         = false
          + http_verb                        = "GET"
          + parse_dependent_requests_enabled = false
          + url                              = "https://api-web.io.pagopa.it"
        }

      + validation_rules {
          + expected_status_code        = 404
          + ssl_cert_remaining_lifetime = 7
          + ssl_check_enabled           = true
        }
    }

  # module.monitoring_itn.azurerm_application_insights_standard_web_test.web_tests["api.io.italia.it"] will be created
  + resource "azurerm_application_insights_standard_web_test" "web_tests" {
      + application_insights_id = (known after apply)
      + enabled                 = true
      + frequency               = 900
      + geo_locations           = [
          + "emea-nl-ams-azr",
        ]
      + id                      = (known after apply)
      + location                = "italynorth"
      + name                    = "api.io.italia.it-test-io-p-itn-appi-01"
      + resource_group_name     = "io-p-itn-common-rg-01"
      + retry_enabled           = true
      + synthetic_monitor_id    = (known after apply)
      + timeout                 = 30

      + request {
          + follow_redirects_enabled         = false
          + http_verb                        = "GET"
          + parse_dependent_requests_enabled = false
          + url                              = "https://api.io.italia.it"
        }

      + validation_rules {
          + expected_status_code        = 404
          + ssl_cert_remaining_lifetime = 7
          + ssl_check_enabled           = true
        }
    }

  # module.monitoring_itn.azurerm_application_insights_standard_web_test.web_tests["api.io.pagopa.it"] will be created
  + resource "azurerm_application_insights_standard_web_test" "web_tests" {
      + application_insights_id = (known after apply)
      + enabled                 = true
      + frequency               = 900
      + geo_locations           = [
          + "emea-nl-ams-azr",
        ]
      + id                      = (known after apply)
      + location                = "italynorth"
      + name                    = "api.io.pagopa.it-test-io-p-itn-appi-01"
      + resource_group_name     = "io-p-itn-common-rg-01"
      + retry_enabled           = true
      + synthetic_monitor_id    = (known after apply)
      + timeout                 = 30

      + request {
          + follow_redirects_enabled         = false
          + http_verb                        = "GET"
          + parse_dependent_requests_enabled = false
          + url                              = "https://api.io.pagopa.it"
        }

      + validation_rules {
          + expected_status_code        = 404
          + ssl_cert_remaining_lifetime = 7
          + ssl_check_enabled           = true
        }
    }

  # module.monitoring_itn.azurerm_application_insights_standard_web_test.web_tests["app-backend.io.italia.it"] will be created
  + resource "azurerm_application_insights_standard_web_test" "web_tests" {
      + application_insights_id = (known after apply)
      + enabled                 = true
      + frequency               = 900
      + geo_locations           = [
          + "emea-nl-ams-azr",
        ]
      + id                      = (known after apply)
      + location                = "italynorth"
      + name                    = "app-backend.io.italia.it-test-io-p-itn-appi-01"
      + resource_group_name     = "io-p-itn-common-rg-01"
      + retry_enabled           = true
      + synthetic_monitor_id    = (known after apply)
      + timeout                 = 30

      + request {
          + follow_redirects_enabled         = false
          + http_verb                        = "GET"
          + parse_dependent_requests_enabled = false
          + url                              = "https://app-backend.io.italia.it/info"
        }

      + validation_rules {
          + expected_status_code        = 200
          + ssl_cert_remaining_lifetime = 7
          + ssl_check_enabled           = true
        }
    }

  # module.monitoring_itn.azurerm_application_insights_standard_web_test.web_tests["assets.cdn.io.italia.it"] will be created
  + resource "azurerm_application_insights_standard_web_test" "web_tests" {
      + application_insights_id = (known after apply)
      + enabled                 = true
      + frequency               = 900
      + geo_locations           = [
          + "emea-nl-ams-azr",
        ]
      + id                      = (known after apply)
      + location                = "italynorth"
      + name                    = "assets.cdn.io.italia.it-test-io-p-itn-appi-01"
      + resource_group_name     = "io-p-itn-common-rg-01"
      + retry_enabled           = true
      + synthetic_monitor_id    = (known after apply)
      + timeout                 = 30

      + request {
          + follow_redirects_enabled         = false
          + http_verb                        = "GET"
          + parse_dependent_requests_enabled = false
          + url                              = "https://assets.cdn.io.italia.it/status/backend.json"
        }

      + validation_rules {
          + expected_status_code        = 200
          + ssl_cert_remaining_lifetime = 7
          + ssl_check_enabled           = true
        }
    }

  # module.monitoring_itn.azurerm_application_insights_standard_web_test.web_tests["assets.cdn.io.pagopa.it"] will be created
  + resource "azurerm_application_insights_standard_web_test" "web_tests" {
      + application_insights_id = (known after apply)
      + enabled                 = true
      + frequency               = 900
      + geo_locations           = [
          + "emea-nl-ams-azr",
        ]
      + id                      = (known after apply)
      + location                = "italynorth"
      + name                    = "assets.cdn.io.pagopa.it-test-io-p-itn-appi-01"
      + resource_group_name     = "io-p-itn-common-rg-01"
      + retry_enabled           = true
      + synthetic_monitor_id    = (known after apply)
      + timeout                 = 30

      + request {
          + follow_redirects_enabled         = false
          + http_verb                        = "GET"
          + parse_dependent_requests_enabled = false
          + url                              = "https://assets.cdn.io.pagopa.it/status/backend.json"
        }

      + validation_rules {
          + expected_status_code        = 200
          + ssl_cert_remaining_lifetime = 7
          + ssl_check_enabled           = true
        }
    }

  # module.monitoring_itn.azurerm_application_insights_standard_web_test.web_tests["continua.io.pagopa.it"] will be created
  + resource "azurerm_application_insights_standard_web_test" "web_tests" {
      + application_insights_id = (known after apply)
      + enabled                 = true
      + frequency               = 900
      + geo_locations           = [
          + "emea-nl-ams-azr",
        ]
      + id                      = (known after apply)
      + location                = "italynorth"
      + name                    = "continua.io.pagopa.it-test-io-p-itn-appi-01"
      + resource_group_name     = "io-p-itn-common-rg-01"
      + retry_enabled           = true
      + synthetic_monitor_id    = (known after apply)
      + timeout                 = 30

      + request {
          + follow_redirects_enabled         = false
          + http_verb                        = "GET"
          + parse_dependent_requests_enabled = false
          + url                              = "https://continua.io.pagopa.it"
        }

      + validation_rules {
          + expected_status_code        = 200
          + ssl_cert_remaining_lifetime = 7
          + ssl_check_enabled           = true
        }
    }

  # module.monitoring_itn.azurerm_application_insights_standard_web_test.web_tests["developerportal-backend.io.italia.it"] will be created
  + resource "azurerm_application_insights_standard_web_test" "web_tests" {
      + application_insights_id = (known after apply)
      + enabled                 = true
      + frequency               = 900
      + geo_locations           = [
          + "emea-nl-ams-azr",
        ]
      + id                      = (known after apply)
      + location                = "italynorth"
      + name                    = "developerportal-backend.io.italia.it-test-io-p-itn-appi-01"
      + resource_group_name     = "io-p-itn-common-rg-01"
      + retry_enabled           = true
      + synthetic_monitor_id    = (known after apply)
      + timeout                 = 30

      + request {
          + follow_redirects_enabled         = false
          + http_verb                        = "GET"
          + parse_dependent_requests_enabled = false
          + url                              = "https://developerportal-backend.io.italia.it/info"
        }

      + validation_rules {
          + expected_status_code        = 200
          + ssl_cert_remaining_lifetime = 7
          + ssl_check_enabled           = true
        }
    }

  # module.monitoring_itn.azurerm_application_insights_standard_web_test.web_tests["firmaconio.selfcare.pagopa.it"] will be created
  + resource "azurerm_application_insights_standard_web_test" "web_tests" {
      + application_insights_id = (known after apply)
      + enabled                 = true
      + frequency               = 900
      + geo_locations           = [
          + "emea-nl-ams-azr",
        ]
      + id                      = (known after apply)
      + location                = "italynorth"
      + name                    = "firmaconio.selfcare.pagopa.it-test-io-p-itn-appi-01"
      + resource_group_name     = "io-p-itn-common-rg-01"
      + retry_enabled           = true
      + synthetic_monitor_id    = (known after apply)
      + timeout                 = 30

      + request {
          + follow_redirects_enabled         = false
          + http_verb                        = "GET"
          + parse_dependent_requests_enabled = false
          + url                              = "https://firmaconio.selfcare.pagopa.it/health"
        }

      + validation_rules {
          + expected_status_code        = 200
          + ssl_cert_remaining_lifetime = 7
          + ssl_check_enabled           = true
        }
    }

  # module.monitoring_itn.azurerm_application_insights_standard_web_test.web_tests["github-raw-status-backend"] will be created
  + resource "azurerm_application_insights_standard_web_test" "web_tests" {
      + application_insights_id = (known after apply)
      + enabled                 = false
      + frequency               = 900
      + geo_locations           = [
          + "emea-nl-ams-azr",
        ]
      + id                      = (known after apply)
      + location                = "italynorth"
      + name                    = "github-raw-status-backend-test-io-p-itn-appi-01"
      + resource_group_name     = "io-p-itn-common-rg-01"
      + retry_enabled           = true
      + synthetic_monitor_id    = (known after apply)
      + timeout                 = 30

      + request {
          + follow_redirects_enabled         = false
          + http_verb                        = "GET"
          + parse_dependent_requests_enabled = false
          + url                              = "https://raw.githubusercontent.com/pagopa/io-services-metadata/master/status/backend.json"
        }

      + validation_rules {
          + expected_status_code        = 200
          + ssl_cert_remaining_lifetime = 7
          + ssl_check_enabled           = true
        }
    }

  # module.monitoring_itn.azurerm_application_insights_standard_web_test.web_tests["io.italia.it"] will be created
  + resource "azurerm_application_insights_standard_web_test" "web_tests" {
      + application_insights_id = (known after apply)
      + enabled                 = true
      + frequency               = 900
      + geo_locations           = [
          + "emea-nl-ams-azr",
        ]
      + id                      = (known after apply)
      + location                = "italynorth"
      + name                    = "io.italia.it-test-io-p-itn-appi-01"
      + resource_group_name     = "io-p-itn-common-rg-01"
      + retry_enabled           = true
      + synthetic_monitor_id    = (known after apply)
      + timeout                 = 30

      + request {
          + follow_redirects_enabled         = false
          + http_verb                        = "GET"
          + parse_dependent_requests_enabled = false
          + url                              = "https://io.italia.it"
        }

      + validation_rules {
          + expected_status_code        = 200
          + ssl_cert_remaining_lifetime = 7
          + ssl_check_enabled           = true
        }
    }

  # module.monitoring_itn.azurerm_log_analytics_workspace.log will be created
  + resource "azurerm_log_analytics_workspace" "log" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = (known after apply)
      + local_authentication_enabled    = (known after apply)
      + location                        = "italynorth"
      + name                            = "io-p-itn-log-01"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "io-p-itn-common-rg-01"
      + retention_in_days               = 90
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
      + workspace_id                    = (known after apply)
    }

  # module.function_app_services.module.function_services_dx.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_INSTRUMENTATIONKEY"                  = "ab45103a-cb4f-474b-933f-d802ed1082d5"
            # (61 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-funcsvc-rg-01/providers/Microsoft.Web/sites/io-p-itn-funcsvc-func-01"
        name                                           = "io-p-itn-funcsvc-func-01"
        tags                                           = {
            "BusinessUnit"                           = "App IO"
            "CostCenter"                             = "TS000 - Tecnologia e Servizi"
            "CreatedBy"                              = "Terraform"
            "Environment"                            = "Prod"
            "ManagementTeam"                         = "IO Platform"
            "ModuleName"                             = "azure_function_app"
            "ModuleSource"                           = "DX"
            "ModuleVersion"                          = "2.0.2"
            "Source"                                 = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (33 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.function_app_services.module.function_services_dx.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_INSTRUMENTATIONKEY"                  = "ab45103a-cb4f-474b-933f-d802ed1082d5"
            # (61 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-funcsvc-rg-01/providers/Microsoft.Web/sites/io-p-itn-funcsvc-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "2.0.2"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (31 unchanged attributes hidden)

      ~ site_config {
          - application_insights_key                      = (sensitive value) -> null
            # (33 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.github_runner_itn.module.container_app_github_runner.azurerm_container_app_job.github_runner will be updated in-place
  ~ resource "azurerm_container_app_job" "github_runner" {
        id                           = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-github-runner-rg-01/providers/Microsoft.App/jobs/io-p-itn-io-infra-caj-01"
        name                         = "io-p-itn-io-infra-caj-01"
      ~ tags                         = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "ModuleName"     = "github_selfhosted_runner_on_container_app_jobs"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "1.1.2" -> "1.1.3"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (8 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.platform_api_gateway_apim_itn.module.platform_api_gateway.azurerm_api_management.this will be updated in-place
  ~ resource "azurerm_api_management" "this" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01"
        name                          = "io-p-itn-platform-api-gateway-apim-01"
        tags                          = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "ModuleName"     = "azure_api_management"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "1.2.2"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (21 unchanged attributes hidden)

      ~ hostname_configuration {
          ~ proxy {
              ~ default_ssl_binding             = true -> false
                # (12 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }

        # (8 unchanged blocks hidden)
    }

  # module.platform_service_bus_namespace_itn.module.platform_service_bus_namespace.data.azurerm_private_dns_zone.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_private_dns_zone" "this" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.servicebus.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "io-p-evt-rg"
    }

  # module.platform_service_bus_namespace_itn.module.platform_service_bus_namespace.azurerm_private_endpoint.service_bus_pep[0] will be updated in-place
  ~ resource "azurerm_private_endpoint" "service_bus_pep" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-platform-sbns-pep-01"
        name                          = "io-p-itn-platform-sbns-pep-01"
      ~ tags                          = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "ModuleName"     = "azure_service_bus_namespace"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.0.5" -> "0.0.6"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (7 unchanged attributes hidden)

      ~ private_dns_zone_group {
            id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-platform-sbns-pep-01/privateDnsZoneGroups/private-dns-zone-group"
            name                 = "private-dns-zone-group"
          ~ private_dns_zone_ids = [
              - "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-evt-rg/providers/Microsoft.Network/privateDnsZones/privatelink.servicebus.windows.net",
            ] -> (known after apply)
        }

        # (1 unchanged block hidden)
    }

  # module.platform_service_bus_namespace_itn.module.platform_service_bus_namespace.azurerm_servicebus_namespace.this will be updated in-place
  ~ resource "azurerm_servicebus_namespace" "this" {
        id                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ServiceBus/namespaces/io-p-itn-platform-sbns-01"
        name                                = "io-p-itn-platform-sbns-01"
      ~ tags                                = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "ModuleName"     = "azure_service_bus_namespace"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.0.5" -> "0.0.6"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 26 to add, 11 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.apim_itn.module.apim.azurerm_api_management.this,
  on .terraform/modules/apim_itn.apim/main.tf line 18, in resource "azurerm_api_management" "this":
  18: resource "azurerm_api_management" "this" {

`key_vault_id` has been deprecated in favour of `key_vault_certificate_id`
and will be removed in v5.0 of the AzureRM provider

(and 23 more similar warnings elsewhere)
::error::Terraform exited with code 1.
```

</details>
